In [116]:
import pandas as pd

In [118]:
df = pd.read_csv('C:/Users/Mehedi Hassan Galib/Desktop/Python/datas/rev.csv')
df.head(3)

   Year Revenue  Salary   Revenue_1  Status
0  2000   $1000  2000.0  $1,000.00        0
1  2001   $2000  3000.0  $2,000.00        0
2  2002   $3000  4000.0  $3,000.00        0

In [119]:
df.dtypes

Year           int64
Revenue       object
Salary       float64
Revenue_1     object
Status         int64
dtype: object

<br/>

## Float to Int

In [120]:
df['Salary'] = df['Salary'].astype('int')

In [121]:
df.head(2)

   Year Revenue  Salary   Revenue_1  Status
0  2000   $1000    2000  $1,000.00        0
1  2001   $2000    3000  $2,000.00        0

<br/>

## Trying to sum up the revenue column.
#### But it can't be happened as this column is an object type due to the presence of '$'

In [122]:
df['Revenue'].sum()

'$1000$2000$3000$4000$5000$6000$7000$8000$9000$10000$11000$12000$13000$14000$15000$16000'

<br/>

## Removing the dollar sign and convert it into Int

In [123]:
df['Revenue'] = df['Revenue'].str.strip('$')
df['Revenue'] = df['Revenue'].astype('int')

In [124]:
df.head(2)

   Year  Revenue  Salary   Revenue_1  Status
0  2000     1000    2000  $1,000.00        0
1  2001     2000    3000  $2,000.00        0

<br/>

## Ta-Na-Na Done!

In [125]:
df['Revenue'].sum()

136000

<br/>

## Now Dealing with dollar sign along with comma

In [126]:
df['Revenue_1'] = df['Revenue_1'].str.strip('$')
df['Revenue_1'] = df['Revenue_1'].str.replace(',','')
df['Revenue_1'] = pd.to_numeric(df['Revenue_1'])

In [127]:
df.dtypes

Year           int64
Revenue        int32
Salary         int32
Revenue_1    float64
Status         int64
dtype: object

<br/>

## Numeric to Categorical

In [105]:
df['Status'] = df['Status'].astype('category')

In [106]:
df['Status'].dtypes

CategoricalDtype(categories=[0, 1], ordered=False)